# Add Repository
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'staticfloat/julia'

# packages
brew 'aircrack-ng'
brew 'apache-spark'
brew 'apple-gcc42'
brew 'arpack'
brew 'autoenv'
brew 'autojump'
brew 'autossh'
brew 'bash'
brew 'boot2docker'
brew 'brew-cask'
brew 'coreutils'
brew 'epstool'
brew 'ffmpeg'
brew 'gcc'
brew 'gdal'
brew 'gist'
brew 'git'
brew 'gl2ps'
brew 'gnu-sed'
brew 'gnuplot'
brew 'gradle'
brew 'graphicsmagick'
brew 'graphviz'
brew 'hadoop'
brew 'jenv'
brew 'jq'
brew 'julia'
brew 'libksba'
brew 'libsodium'
brew 'libyaml'
brew 'lua'
brew 'matplotlib'
brew 'mercurial'
brew 'mobile-shell'
brew 'mtr'
brew 'openblas'
brew 'opencv'
brew 'ossp-uuid'
brew 'pandoc'
brew 'pstoedit'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pyside'
brew 'python'
brew 'qhull'
brew 'qrupdate'
brew 'qscintilla2'
brew 'scipy'
brew 'shogun'
brew 'sqlitebrowser'
brew 'suite-sparse'
brew 'texinfo'
brew 'thrift'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'wireshark'
brew 'youtube-dl'
brew 'zeromq'
brew 'zlib'
brew 'zsh-completions'

# .dmg
cask 'betterzipql'
cask 'cheatsheet'
cask 'keyboard-cleaner'
cask 'launchrocket'
cask 'macdown'
cask 'mactex'
cask 'mplayerx'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'texmaker'
cask 'webp-quicklook'
